In [24]:
#Debrato Ghosh
#240953708
#PE 83
#Week_4_Data_loading

In [2]:
import numpy as np
import pandas as pd

In [4]:
df1 = pd.read_csv("examples/ex1.csv")
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
df2=pd.read_csv("examples/ex2.csv", header=None)
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
df2=pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
df3 = pd.read_csv("examples/ex3.csv")
df3

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [12]:
pd.isna(df3)

   A         B         C
0                  False
1                  False
2                  False
3                  False

In [13]:
df3.isna()

   A         B         C
0                  False
1                  False
2                  False
3                  False

In [15]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")
xlsx

In [16]:
xlsx.sheet_names

['Sheet1']

In [17]:
df_mrks1=xlsx.parse(sheet_name="Sheet1")
df_mrks1

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [20]:
df_mrks3=xlsx.parse(sheet_name="Sheet1", index_col=0)
df_mrks3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
frame1 = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")
frame1

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [23]:
frame1.to_excel("Mrks2.xlsx")